import Style from './index.module.scss'

const privacy = (): JSX.Element => (
  <div className={Style['_modal']}>
    <p></p>
    <h4> {'นโยบายความเป็นส่วนตัว (Privacy Policy)'} </h4>

    <p>&nbsp;</p>

    <p>&nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp;นโยบายความเป็นส่วนตัวฉบับนี้&nbsp; ซึ่งต่อไปนี้จะเรียกว่า&nbsp; &quot;นโยบาย&quot;&nbsp; บังคับใช้ครั้งแรกเมื่อวันที่&nbsp; 24&nbsp; สิงหาคม&nbsp; 2565&nbsp; &nbsp;โดยมีรายละเอียดดังต่อไปนี้</p>
    <p>&nbsp;</p>

    <p>ข้อ&nbsp; 1&nbsp; คำนิยาม&nbsp;&nbsp; ภายในนโยบายฉบับนี้</p>
    <p>&nbsp;</p>

    <p>(ก)&nbsp; &quot;โปรแกรม&nbsp; หรือโปรแกรมคอมพิวเตอร์&quot;&nbsp; หมายความว่า&nbsp; แอพพลิเคชั่น&nbsp; ชื่อว่า&nbsp; Omise&nbsp; เป็นโปรแกรมชำระค่าบริการและโปรแกรมชื่อว่า&nbsp; DSLR&nbsp; Booth&nbsp; เป็นโปรแกรมถ่ายรูป</p>

    <p>
      (ข)&nbsp; &quot;ผู้ควบคุมข้อมูล&quot;&nbsp; หมายความว่า&nbsp; ผู้ให้บริการหรือเจ้าของโปรแกรมตามนโยบายฉบับนี้&nbsp; อันได้แก่&nbsp; บริษัท&nbsp; ฟูจิฟิล์ม&nbsp; (ประเทศไทย)&nbsp; จำกัด&nbsp; สำนักงานใหญ่&nbsp; เลขที่&nbsp; 123&nbsp;
      อาคารซันทาวเวอร์ส&nbsp; เอ&nbsp; ชั้น 23-26&nbsp; ถนนวิภาวดีรังสิต แขวงจอมพล&nbsp; เขตจตุจักร&nbsp; กรุงเทพมหานคร&nbsp; 10900&nbsp; เบอร์โท ร 02-270-6000&nbsp; และที่อยู่อีเมล์&nbsp; Xseries.info@fujiflim.com
    </p>

    <p>(ค)&nbsp; &quot;ผู้ประมวลผลข้อมูล&quot;&nbsp; หมายความว่า&nbsp; บุคคลภายนอกซึ่งประมวลข้อมูลเพื่อประโยชน์หรือในนามของผู้ควบคุมข้อมูล</p>

    <p>
      (ง)&nbsp; &quot;ข้อมูล&quot;&nbsp; หมายความว่า&nbsp; สื่อที่สื่อความหมายให้รู้เรื่องราวข้อเท็จจริง&nbsp; ข้อมูล&nbsp; หรือสิ่งใดๆ&nbsp; ไม่ว่าการสื่อความหมายนั้นจะทำได้โดยสภาพของสิ่งนั้นเองหรือโดยผ่านวิธีการใดๆ&nbsp;
      และไม่ว่าจะได้จัดทำไว้ในรูปของเอกสาร&nbsp; แพ้ม รายงาน&nbsp; หนังสือ&nbsp; แผ่นผัง&nbsp; แผนที่&nbsp; ภาพวาด&nbsp; ภาพถ่าย&nbsp; ฟิล์ม&nbsp; การบันทึกภาพหรือเสียง&nbsp; การบันทึกโดยเครื่องคอมพิวเตอร์&nbsp; โดยวิธีการทางอิเล็กทรอนิกส์&nbsp;
      หรือวิธีอื่นใดที่ทำให้สิ่งที่บันทึกไว้ปรากฎได้
    </p>

    <p>(จ)&nbsp; &quot;ข้อมูลส่วนบุคคล&quot;&nbsp; หมายความว่า&nbsp; ข้อมูลเกี่ยวกับบุคคลธรรมดาใดๆ&nbsp; ซึ่งทำให้สามารถระบุตัวของบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม</p>

    <p>
      (ฉ)&nbsp; &quot;ข้อมูลส่วนบุคคลที่มีความอ่อนไหว&quot;&nbsp; หรือ&nbsp; &quot;Sensitive Data&quot;&nbsp; หมายความว่า&nbsp; ข้อมูลส่วนบุคคลของผู้ใช้งานที่เกี่ยวกับเชื้อชาติ&nbsp; เผ่าพันธุ์&nbsp; ความคิดเห็นทางการเมือง&nbsp;
      ความเชื่อในลัทธิ&nbsp; ศาสนา&nbsp; หรือปรัชญา&nbsp; พฤติกรรมทางเพศ ประวัติอาชญากรรม&nbsp; ข้อมูลสุขภาพ&nbsp; ความพิการ&nbsp; พันธุกรรม&nbsp; ข้อมูลชีวภาพ&nbsp; ข้อมูลภาพจำลองใบหน้า&nbsp; ม่านตา&nbsp; หรือลายนิ้วมือ&nbsp; ข้อมูลสหภาพแรงงาน
      หรือข้อมูลอื่นใดซึ่งคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลได้ประกาศให้เป็นข้อมูลส่วนบุคคลที่มีความอ่อนไหว
    </p>

    <p>(ช)&nbsp; &quot;ผู้ใช้งาน&quot;&nbsp; หมายความว่า&nbsp; ท่าน&nbsp; ผู้เยี่ยมชม&nbsp; ผู้ใช้&nbsp; ผู้เป็นสมาชิกของโปรแกรม&nbsp; ซึ่งเป็นเจ้าของข้อมูลส่วนบุคคลตามนโยบายฉบับนี้&nbsp; บุคคลและเงื่อนไขในการเข้าถึงข้อมูลส่วนบุคคลนั้น</p>

    <p>(ซ)&nbsp; การเก็บรวบรวม&nbsp; ใช้&nbsp; หรือเปิดเผยข้อมูส่วนบุคคลที่ได้รับยกเว้นไม่ต้องขอความยินยอมจากผู้ใช้งานเจ้าของข้อมูล</p>

    <p>(ฌ)&nbsp; การปฏิเสธคำขอและการค้ดค้านต่างๆ</p>

    <p>(ญ)&nbsp; รายละเอียดเกี่ยวกับมาตรการรักษาความมั่นคงปลอดภัยในข้อมูลส่วนบุคคล</p>
    <p>&nbsp;</p>
    <p>
      <strong>การแก้ไขเปลี่ยนแปลงนโยบาย</strong>
    </p>

    <ul>
      <li>
        ผู้ควบคุมข้อมูลอาจแก้ไขและเปลี่ยนแปลงข้อความในนโยบายฉบับนี้ได้&nbsp; ไม่ว่าเวลาใดก็ตาม และไม่ว่าทั้งหมดหรือบางส่วน&nbsp;
        โดยผู้ควบคุมข้อมูลจะแจ้งให้ผู้ใช้งานทราบเมื่อมีการเปลี่ยนแปลงในแต่ละคราวเพื่อให้ผู้ใช้งานได้พิจารณาและดำเนินการยอมรับด้วยวิธีการทางอิเล็กทรอนิกส์หรือวิธีการอื่นใด&nbsp;
        และหากว่าผู้ใช้งานได้ดำเนินการเพื่อยอมรับนั้นแล้วให้ถือว่านโยบายที่แก้ไขเพิ่มเติมดังกล่าวเป็นส่วนหนึ่งของนโยบายฉบับนี้ด้วย อนึ่ง
        ผู้ใช้งานอาจเข้าถึงนโยบายความเป็นส่วนตัวที่มีการแก้ไขและเปลี่ยนแปลงล่าสุดได้จากแหล่งที่ผู้ควบคุมข้อมูลจัดแสดงไว้บนโปรแกรม
      </li>
      <li>
        ความสัมพันธ์ของคู่สัญญาโดยที่คู่สัญญาทั้งสองฝ่ายเข้าใจและทราบดีว่า&nbsp; การเข้าทำนโยบายฉบับนี้ไม่ทำให้คู่สัญญาและพนักงานของคู่สัญญาแต่ละฝ่ายมีความสัมพันธ์ในฐานะเป็นลูกจ้างตามกฎหมายแรงงานหรือเป็นหุ้นส่วนกันตามกฎหมายหุ้นส่วนและบริษัทแต่อย่างใด
      </li>
      <li>
        การโอนสิทธิเว้นแต่จะได้กำหนดไว้เป็นอย่างอื่นอย่างชัดแจ้งในโยบายฉบับนี้&nbsp; คู่สัญญาตกลงจะไม่โอนสิทธิ หน้าที่และ/หรือความรับผิดตามนโยบายฉบับนี้ให้แก่บุคคลใดโดยมิได้รับความยินยอมเป็นลายลักษณ์อักษรจากคู่สัญญาอีกฝ่ายหนึ่งเป็นการล่วงหน้าก่อน
      </li>
      <li>การระงับข้อพิพาท&nbsp; หากมีข้อโต้เถียง&nbsp;&nbsp;ข้อขัดแย้งใดๆ&nbsp; เกิดขึ้นอันเนื่องมาจากนโยบายฉบับนี้&nbsp; หากคู่สัญญาไม่สามารถตกลงกันได้&nbsp; คู่สัญญาตกลงจะนำข้อพิพาทดังกล่าวขึ้นฟ้องต่อศาลในประเทศไทย</li>
    </ul>

    <p>&nbsp;</p>

    <p>สนใจติดต่อสอบถามรายละเอียดเพิ่มเติมได้ในเวลาทำการ</p>

    <p>02-270-6000</p>

    <p>Xseries.info@fujiflim.com</p>
  </div>
)

export default privacy
