import Style from './index.module.scss'

const PrivacyPolicy = (): JSX.Element => (
  <div className={Style['_modal']}>
    <h4> { 'นโยบายความเป็นส่วนตัว' } </h4>
    <p>
        เอกสารฉบับนี้เป็นเอกสารแจ้งการประมวลผลข้อมูลส่วนบุคคล (Privacy Notice) ของบริษัท ฟูจิฟิล์ม
        (ประเทศไทย) จําากัด ภายใต้แบรนด์สินค้า “ฟูจิฟิล์ม” หรือแบรนด์สินค้าที่เข้าร่วมกับฟูจิฟิล์ม (“บริษัท”) โดย
        บริษัทขอแนะนําาให้ท่านอ่านและทําาความเข้าใจเอกสารฉบับนี้โดยละเอียด เนื่องจากเอกสารฉบับนี้อธิบายถึงการ
        ปฏิบัติต่อข้อมูลส่วนบุคคลของท่าน เช่น การเก็บรวบรวม การใช้ การเปิดเผย รวมถึงสิทธิต่าง ๆ ของท่าน เป็นต้น
        เพื่อให้ท่านได้รับทราบถึงมาตรการการคุ้มครองข้อมูลส่วนบุคคลของบริษัท ตามพระราชบัญญัติคุ้มครองข้อมูล
        ส่วนบุคคล พ.ศ. 2562
    </p>
    <h4> 1. ข้อมูลส่วนบุคคล </h4>
    <p>
        หมายถึง ข้อมูลเกี่ยวกับผู้ใช้งาน F-Foto Box ที่สามารถระบุตัวผู้ใช้งาน หรืออาจจะระบุตัวผู้ใช้งานนั ้นได้ ไม่ว่า
        ทางตรงหรือทางอ้อม
    </p>
    <p>
            ในกรณีที่ผู้ใช้งาน F-Foto Box ข้อมูลส่วนบุคคลที่บริษัทอาจทําาการเก็บรวบรวมเพิ่มเติม (ขึ้นอยู่กับข้อ
        กําาหนดและเงื่อนไขของกิจกรรมแต่ละกิจกรรม) ได้แก่
    </p>
    <ul className="a">
      <li>
        ชื่อ-นามสกุล
      </li>
      <li>
        อีเมล์
      </li>
      <li>
        เบอร์โทรศัพท์
      </li>
    </ul>
    <h4> 2. การเก็บรวบรวมข้อมูลส่วนบุคคล</h4>
    <p>
            บริษัทจะเก็บรวบรวมข้อมูลส่วนบุคคลของผู้ใช้งาน เมื่อได้รับความยินยอมล่วงหน้าจากผู้ใช้งานผ่านกิจกรรมใด
        กิจกรรมหนึ่งของผู้ใช้งานดังต่อไปนี้
    </p>
    <ul className="a">
      <li>
      1.	ข้อมูลที่ระบุตัวบุคคล เช่น ชื่อ เพศ รูปภาพโปรไฟล์และวันเกิดของท่าน
      </li>
      <li>
      2.	ข้อมูลการติดต่อ เช่น ข้อมูลการจัดส่ง ที่อยู่สำหรับส่งสินค้า หมายเลขโทรศัพท์ อีเมล
      </li>
      <li>
      3.	ข้อมูลทางการเงิน เช่น รายละเอียดบัญชีธนาคาร รายละเอียดบัตรเครดิต และรายละเอียดการชำระเงิน (ข้อมูลทางบัญชีดังกล่าวอาจถูกเก็บโดยตรงจากบริษัทในเครือของเรา และ/หรือบุคคลภายนอกที่ให้บริการการชำระเงิน)
      </li>
      <li>
      4.	อื่นๆ
      </li>
    </ul>
    <br></br>
    <h4> 3.	วัตถุประสงค์การเก็บรวบรวมข้อมูลส่วนบุคคล </h4>
    <p> บริษัทจะเก็บรวบรวมข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์ดังต่อไปนี้เท่านั้น</p>
    <ul className="a">
      <li>
       การจัดทำฐานข้อมูลและใช้ข้อมูลผู้ใช้บริการเพื่อพัฒนาคุณภาพการให้บริการ
      </li>
      <li>
        เพื่อดำเนินการตามคำสั่งซื้อที่ท่านทำผ่านแพลตฟอร์ม
      </li>
      <li>
        เพื่อตรวจสอบและดำเนินการเกี่ยวกับธุรกรรมการชำระเงิน (รวมทั้ง การชำระเงินโดยบัตรเครดิต การโอนเงินผ่านบัญชีธนาคาร การชำระเงินโดยไม่ผ่านระบบอินเตอร์เน็ต การโอนเงิน หรือการทำธุรกรรมผ่านกระเป๋าเงินอิเล็กทรอนิกส์) ซึ่งเกี่ยวกับการชำระเงินใด ๆ ที่เกี่ยวกับท่าน และ/หรือ บริการที่ท่านใช้ ทั้งนี้ เพื่อตรวจสอบและดำเนินการตามธุรกรรมการชำระเงินของท่าน เราจะต้องส่งต่อข้อมูลการชำระเงิน ซึ่งอาจรวมถึงข้อมูลส่วนบุคคล ให้กับบุคคลภายนอก อาทิ ผู้ให้บริการการชำระเงินของเรา
      </li>
    </ul>
    <br></br>
    <h4> 4.	การจัดการและการคุ้มครองข้อมูลส่วนบุคคล </h4>
    <p>
        การจัดการและการคุ้มครองข้อมูลส่วนบุคคลของบริษัทจะอยู่ภายใต้การจัดการและการคุ้มครองข้อมูลส่วนบุคคล ของ บริษัท ฟูจิฟิล์ม (ประเทศไทย) จำกัด ตามมาตรการข้อ 4.1 ถึง 4.3 เพื่อจัดการและคุ้มครองข้อมูลส่วนบุคคลของลูกค้าอย่างเหมาะสม
    </p>
    <br></br>
    <p>
        4.1 การจัดตั้งองค์กรหรือหน่วยงานเพื่อส่งเสริมและรองรับการคุ้มครองข้อมูลส่วนบุคคลทั้งหมดที่เครือบริษัท ฟูจิฟิล์ม (ประเทศไทย) จำกัด เป็นผู้ดูแลและแต่งตั้งผู้ควบคุมข้อมูลส่วนบุคคลในแต่ละบริษัท และแต่ละแผนกที่จัดการข้อมูลส่วนบุคคล
    </p>
    <br></br>
    <p>
        4.2 การกำหนดนโยบายภายในบริษัท ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลและแนวทางที่ออกโดยหน่วยงานรัฐที่รับผิดชอบเกี่ยวกับการจัดการข้อมูลส่วนบุคคล การให้การศึกษาแก่พนักงานและบุคคลอื่น ๆ ที่เกี่ยวข้องเพื่อให้แน่ใจว่าพวกเขาเข้าใจถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคลและมีความคุ้นเคยกับกฎและแนวทางที่เกี่ยวข้องทั้งหมด
    </p>
    <br></br>
    <p>
        4.3 การจัดตั้งทะเบียนการจัดการข้อมูลส่วนบุคคลและการบังคับใช้ข้อจำกัดที่เหมาะสมในการเข้าถึงข้อมูลส่วนบุคคล และการดำเนินการตามมาตรการรักษาความปลอดภัยที่เหมาะสมและสมเหตุสมผลเพื่อป้องกันการเข้าถึงหรือการรั่วไหล การทำลายหรือการเปลี่ยนแปลงข้อมูลส่วนบุคคล
    </p>
    <br></br>
    <h4>
        5.	ระยะเวลาสําหรับการจัดเก็บข้อมูลส่วนบุคคลของท่าน
    </h4>
    <p>
        บริษัทจะจัดเก็บข้อมูลส่วนบุคคลของท่านเป็นระยะเวลา 18 เดือน นับจากวันที่ข้อมูลส่วนบุคคลของท่านถูกจัดเก็บรวบรวมโดยบริษัทหรือตัวแทนของบริษัท ทั้งนี้ บริษัทจะไม่เก็บข้อมูลส่วนบุคคลของท่านเกินกว่าระยะเวลาที่เราเห็นว่าจําเป็นตามวัตถุประสงค์ที่ได้จัดเก็บ ยกเว้นในกรณีที่เราถูกกฎหมายกำหนดให้เก็บข้อมูลดังกล่าวในระยะเวลาที่นานกว่านั้น
    </p>
    <br></br>
    <h4> 6.	การใช้และเปิดเผยข้อมูลส่วนบุคคล </h4>
    <p>
    1.	บริษัทจะไม่ใช้หรือเปิดเผยข้อมูลส่วนบุคคลนอกเหนือไปจากวัตถุประสงค์ในการจัดเก็บรวบรวมข้อมูลตามข้อ 3. และไม่เปิดเผยต่อบุคคลภายนอก เว้นแต่ในกรณีดังต่อไปนี้
    </p>
    <ul className="a">
      <li>
      1.	ได้รับความยินยอมจากเจ้าของข้อมูลส่วนบุคคลเป็นการล่วงหน้า
      </li>
      <li>
      2.	เพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของบุคคล
      </li>
      <li>
      3.	เป็นการจำเป็นเพื่อปฏิบัติตามสัญญาซึ่งเจ้าของข้อมูลส่วนบุคคลเป็นคู่สัญญาหรือเพื่อใช้ในการดำเนินการตามคำขอของเจ้าของข้อมูลส่วนบุคคลก่อนเข้าทำสัญญานั้น
      </li>
      <li>
      4.	เป็นการจำเป็นเพื่อการปฏิบัติหน้าที่ในการดำเนินภารกิจเพื่อประโยชน์สาธารณะของบริษัท หรือเพื่อการปฏิบัติหน้าที่ตามที่รัฐให้อำนาจ
      </li>
      <li>
      5.	เป็นการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมายของบริษัท
      </li>
      <li>
      6.	เป็นการปฏิบัติตามกฎหมาย
      </li>
    </ul>
    <p> 2.	บริษัทอาจเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้งานเว็บไซต์แก่บุคคลหรือหน่วยงานดังต่อไปนี้ </p>
    <br></br>
    <h4> 7.	บริษัทในเครือและบริษัทในกลุ่มของบริษัท </h4>
    <br></br>
    <h4> 8.	ผู้ให้บริการของบริษัท เพื่อปฏิบัติตามวัตถุประสงค์ของการเก็บรวบรวมข้อมูลส่วนบุคคลตามข้อ 3. เช่น การปรับปรุงเว็บไซต์ การดูแลลูกค้าหลังการขาย การจัดส่งสินค้า รวมถึงการจัดทำสื่อโฆษณาและการประชาสัมพันธ์ เป็นต้น </h4>
    <br></br>
    <h4> 9.	เมื่อบริษัทเปิดเผยข้อมูลส่วนบุคคลของท่าน บริษัทจะดําเนินการเพื่อทําให้ท่านมั่นใจว่าผู้ที่รับข้อมูลไป    จะปกป้องข้อมูลความเป็นส่วนตัวของท่าน เก็บข้อมูลส่วนบุคคลของท่านไว้อย่างปลอดภัย และประมวลผลข้อมูลดังกล่าวภายใต้ขอบเขตของเอกสารฉบับนี้และตามที่กฎหมายกําหนด โดยวิธีการดังกล่าวอาจรวมถึงการเข้าทำสัญญาที่เหมาะสมกับบุคคลภายนอก </h4>
    <br></br>
    <h4> 10.	สิทธิของเจ้าของข้อมูลส่วนบุคคล </h4>
    <p>
        1.	ในกรณีที่ท่านยินยอมให้บริษัทเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน ท่านสามารถเพิกถอนความยินยอมในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่านได้ตลอดเวลา โดยแจ้งให้บริษัททราบ
    </p>
    <br></br>
    <p>
    2.	ท่านสามารถเข้าถึงและขอรับสำเนาข้อมูลส่วนบุคคลของท่านที่อยู่ในความรับผิดชอบของบริษัทได้ รวมถึงขอให้บริษัทเปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลดังกล่าว
    </p>
    <br></br>
    <p>
    3.	ท่านสามารถขอคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน ในกรณีดังต่อไปนี้
    </p>
    <ul className="a">
      <li>
        1.	บริษัทเก็บรวบรวมข้อมูลส่วนบุคคลของท่านโดยได้รับยกเว้นไม่ต้องขอความยินยอมเนื่องจากเป็นการจำเป็นเพื่อการปฏิบัติหน้าที่ในการดำเนินภารกิจเพื่อประโยชน์สาธารณะของบริษัท หรือปฏิบัติหน้าที่ในการใช้อำนาจรัฐตามที่ได้รับมอบหมาย หรือเป็นการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมายของบริษัท เว้นแต่ บริษัทมีเหตุอันชอบด้วยกฎหมายในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลนั้น หรือเป็นไปเพื่อการก่อตั้ง ปฏิบัติตาม ใช้หรือยกขึ้นต่อสู้ซึ่งสิทธิเรียกร้องตามกฎหมาย
      </li>
      <li>
        2.	บริษัทเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์เกี่ยวกับการตลาดแบบตรง
      </li>
      <li>
        3.	บริษัทเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์เกี่ยวกับการศึกษาวิจัยทางวิทยาศาสตร์ ประวัติศาสตร์ หรือสถิติ เว้นแต่เป็นการจำเป็นเพ่อการดำเนินภารกิจเพื่อประโยชน์สาธารณะของบริษัท
      </li>
    </ul>
    <br></br>
    <p>
    4.	ท่านสามารถขอให้บริษัทลบ ทำลาย หรือทำให้ข้อมูลส่วนบุคคลของท่านเป็นข้อมูลที่ไม่สามารถระบุตัวท่านได้ ในกรณีดังต่อไปนี้
    </p>
    <ul className="a">
      <li>
      1.	เมื่อข้อมูลส่วนบุคคลของท่านหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
      </li>
      <li>
      2.	เมื่อท่านถอนความยินยอมในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล และบริษัทไม่มีอำนาจตามกฎหมายที่จะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่านได้ต่อไป
      </li>
      <li>
      3.	เมื่อท่านคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล และบริษัทไม่อาจปฏิเสธคำขอ
      </li>
      <li>
      4.	เมื่อข้อมูลส่วนบุคคลของท่านได้ถูกเก็บรวบรวม ใช้ หรือเปิดเผยโดยไม่ชอบด้วยกฎหมาย
      </li>
    </ul>
    <br></br>
    <p>
    5.	ท่านสามารถขอให้บริษัทระงับการใช้ข้อมูลส่วนบุคคลของท่าน ในกรณีดังต่อไปนี้
    </p>
    <ul className="a">
      <li>
      1.	เมื่อบริษัทอยู่ระหว่างการตรวจสอบความเป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิดของข้อมูลส่วนบุคคลของท่าน
      </li>
      <li>
      2.	เมื่อข้อมูลส่วนบุคคลของท่านเก็บรวบรวม ใช้ หรือเปิดเผยโดยไม่ชอบด้วยกฎหมาย
      </li>
      <li>
      3.	เมื่อข้อมูลส่วนบุคคลของท่านหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
      </li>
      <li>
      4.	เมื่อบริษัทอยู่ระหว่างการพิสูจน์ หรือตรวจสอบเพื่อปฏิเสธคำขอคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่านตามข้อ 3.
      </li>
    </ul>
    <br></br>
    <p>
         6.	ท่านสามารถตรวจสอบได้ว่าข้อมูลส่วนบุคคลของท่านมีความเป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด และหากท่านเห็นว่าข้อมูลส่วนบุคคลใดที่เกี่ยวกับท่านไม่เป็นปัจจุบัน ไม่สมบูรณ์ หรือก่อให้เกิดความเข้าใจผิด ท่านสามารถแจ้งบริษัท เพื่อให้แก้ไข เปลี่ยนแปลง หรือลบข้อมูลส่วนบุคคลนั้นได้
    </p>
    <br></br>
    <p>
        7.	กรณีที่ท่านพบเห็นการละเมิดหรือฝ่าฝืนการคุ้มครองข้อมูลส่วนบุคคลของบริษัท หรือเอกสารฉบับนี้ ท่านสามารถแจ้งเหตุการละเมิดหรือฝ่าฝืนได้ที่บริษัทซึ่งเป็นผู้ควบคุมข้อมูลส่วนบุคคล นอกจากนี้ ท่านยังมีสิทธิร้องเรียนกรณีฝ่าฝืนหรือไม่ปฏิบัติตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ต่อคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลตามหลักเกณฑ์ที่กฎหมายกำหนด
    </p>
    <br></br>
    <p>
        การร้องขอใด ๆ เพื่อการใช้สิทธิของท่านตามที่กล่าวข้างต้น จะต้องกระทำเป็นลายลักษณ์อักษรและขอใช้สิทธิโดยติดต่อมายังบริษัทซึ่งเป็นผู้ควบคุมข้อมูลส่วนบุคคลตามรายละเอียดในข้อ 8. และบริษัทจะใช้ความพยายามอย่างดีที่สุดที่จะดำเนินการภายในระยะเวลาที่สมเหตุสมผล และไม่เกินระยะเวลาที่กฎหมายกำหนด โดยบริษัทจะปฏิบัติตามข้อกำหนดทางกฎหมายที่เกี่ยวกับสิทธิของท่านในฐานะเจ้าของข้อมูลส่วนบุคคล ทั้งนี้ บริษัทสงวนสิทธิในการปฏิเสธคำร้องขอตามสิทธิของท่านในกรณีทีเหตุผลแห่งการปฏิเสธที่เหมาะสมหรือเป็นไปโดยบทบัญญัติของกฎหมาย
    </p>
    <br></br>
    <p>
        บริษัทขอเรียนให้ท่านทราบว่าในกรณีที่ท่านขอให้บริษัทลบ ทำลาย ระงับ ขอให้โอน คัดค้าน หรือทำให้ข้อมูลส่วนบุคคลของท่านไม่สามารถระบุตัวตนได้ หรือถอนความยินยอม อาจทำให้เกิดข้อจำกัดกับบริษัทในการทำธุรกรรมหรือการให้บริการกับท่านบางกรณีได้ ทั้งนี้ภายใต้ข้อกำหนดตามที่กฎหมายกำหนด
    </p>
    <br></br>
    <h4> 11.	ผู้ควบคุมข้อมูลส่วนบุคคล </h4>
    <br></br>
    <p>
    บริษัท ฟูจิฟิล์ม (ประเทศไทย) จำกัด
    </p>
    <br></br>
    <p>
    ที่อยู่: ชั้น 8 อาคาร เอส.พี. เลขที่ 388 ถนนพหลโยธิน แขวงสามเสนใน เขตพญาไท กรุงเทพมหานคร 10400
    </p>
    <br></br>
    <p>
    หมายเลขโทรศัพท์:                02-270-6000
    </p>
    <br></br>
    <p>
    ที่อยู่อีเมล xseries.info@fujifilm.com
    </p>
    <br></br>
    <p>
    เอกสารแจ้งข้อมูลการประมวลผลข้อมูลส่วนบุคคล (Privacy Notice) ฉบับนี้ มีผลใช้บังคับกับข้อมูลส่วนบุคคลของท่านที่บริษัทเป็นผู้เก็บรวบรวม หรือที่ท่านตกลงให้บริษัทเก็บรวบรวม รักษา ใช้ และเปิดเผยข้อมูลส่วนบุคคลของท่าน ทั้งที่มีอยู่แล้ว (ถ้ามี) ตลอดจนข้อมูลส่วนบุคคลของท่านที่บริษัทจะจัดเก็บในอนาคตภายใต้ข้อกำหนดและเงื่อนไขของเอกสารฉบับนี้
    </p>
    <br></br>
    <p>
    เอกสารแจ้งการประมวลผลข้อมูลส่วนบุคคล (Privacy Notice) ฉบับนี้ จัดทำขึ้นเมื่อวันที่ 17  ธันวาคม พ.ศ. 2563
    </p>
  </div>
)

export default PrivacyPolicy