
import Style from './index.module.scss'

const TermAndCondition = (): JSX.Element => (
  <div className={Style['_modal']}>
    <h4> { 'ข้อกำหนดและเงื่อนไข (Terms & Conditions)' } </h4>
    <p>
              F-FOTO BOX ขอแจ้งนโยบายการคืนเงินเพื่อเป็นข้อตกลงและสร้างความเข้าใจเกี่ยวกับการใช้บริการโปรแกรม ดังนี้
    </p>
    <p style={{ marginTop: '10px' }}>
              F-FOTO BOX จะทำการคืนเงินค่าบริการให้แก่ลูกค้า ในกรณีที่ F-FOTO BOX ไม่สามารถให้บริการลูกค้าได้ อันเนื่องมาจากสาเหตุใดสาเหตุหนึ่งดังต่อไปนี้เท่านั้น
    </p>
    <ul className="a">
      <li>
                สินค้าสำหรับให้บริการหมด (เช่นฟิล์มรูปหมด, สินค้าถูกยกเลิก)
      </li>
      <li>
                ราคาค่าบริการไม่ตรงกับที่ระบุทางหน้า website หรือไม่ตรงกับราคาจริง
      </li>
      <li>
                เกิดจากการขัดข้องทางระบบหรือทางเทคนิค
      </li>
      <li>
                เกิดจากเหตุสุดวิสัย
      </li>
      <li>
                กฏหมายกำหนดให้ต้องมีการคืนเงิน
      </li>
    </ul>
    <h4> การส่งคำร้องขอเงินคืนนั้นต้องไม่เกิน 1 วันหลังจากวันที่ได้ใช้บริการ F-FOTO BOX </h4>
    <p>
              บริษัทจะคืนเงินเฉพาะในกรณีที่บริษัทตรวจสอบแล้วพบว่าเป็นความผิดพลาดอันเกิดสาเหตุที่ระบุไว้ข้างต้นเท่านั้น และลูกค้าจะต้องส่งคำร้องขอคืนเงินมาเป็นลายลักษณ์อักษรพร้อมแนบถ่ายภาพหลักฐานชัดเจน และส่งมาที่ Xseries.info@fujifilm.com
    </p>
    <br></br>
    <p>
              ภายหลังจากที่ได้มีการชำระเงินแล้วลูกค้าเกิดการเปลี่ยนใจ (change of mind) ระหว่างการใช้บริการ หรือลูกค้าไม่พอใจคุณภาพของการให้บริการหรือสินค้า ลูกค้าไม่สามารถดำเนินการยกเลิก เปลี่ยนแปลง แก้ไข รายการสั่งซื้อได้ทุกกรณี
    </p>
    <br></br>
    <p>
              บริษัทจะเป็นผู้พิจารณาคำร้องขอคืนเงินของลูกค้าภายใต้ดุลยพินิจของบริษัทแต่เพียงผู้เดียว โดยลูกค้ารับทราบและตกลงว่าผลการพิจารณาของบริษัทนั้นมีผลผูกพัน โดยถือเป็นที่สุดและเด็ดขาด และรับรองและตกลงว่าลูกค้าจะไม่ดำเนิการทางคดีหรือยื่นข้อเรียกร้องใดๆ ต่อบริษัทจากการพิจารณาดังกล่าว
    </p>
    <br></br>
    <p>
              กรณีที่ลูกค้าชำระเงินโดยการโอนเงินเข้าบัญชีของ บริษัท ฟูจิฟิล์ม ประเทศไทย (“บริษัท”) บริษัทจะทำการคืนเงินโดยการโอนกลับไปยังบัญชีที่ลูกค้าใช้ในการชำระเงินเท่านั้น
    </p>
    <br></br>
    <h4> ระยะเวลาดำเนินการคืนเงิน </h4>
    <p>
              บริษัทมีกำหนดระยะเวลาการคืนเงินค่าบริการเบื้องต้นอยู่ที่ประมาณ 15-30 วันทำการ นับตั้งแต่วันที่ บริษัทตรวจสอบคำขอคืนเงินพร้อมหลักฐานดังกล่าวเสร็จเรียบร้อยแล้ว
    </p>
    <br></br>
    <p>
            บริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงข้อกำหนดและเงื่อนไขต่างๆ โดยไม่ต้องแจ้งให้ลูกค้าทราบล่วงหน้า
    </p>
    <br></br>
    <h4> ติดต่อสอบถามข้อมูลเพิ่มเติมได้ที่ </h4>
    <br></br>
    <p><strong> ชื่อร้าน </strong>  Fujifilm Xspace </p>
    <br></br>
    <p><strong> ชื่อผู้ติดต่อ  </strong>  น.ส. ณัฏฐา หมู่ผึ้ง </p>
    <br></br>
    <p><strong> ที่อยู่  </strong>  Fuifilm Xspace 388 อาคาร S.P.Building, ชั้น 1 ถ.พหลโยธิน แขวงสามเสนใน เขตพญาไท กรุงเทพ 10400 </p>
    <br></br>
    <p><strong> เบอร์โทรศัพท์ </strong>  02-270-6108, 065-9502253 </p>
    <br></br>
    <p><strong> ที่อยู่อีเมล์ </strong>  Xseries.info@fujifilm.com </p>
  </div>
)

export default TermAndCondition